app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "rating" = 'R', "updated_at" = '2014-10-15 00:48:54.052310' WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 28 Oct 2014 02:17:45 UTC +00:00], ["description", nil], ["rating", "PG"], ["release_date", nil], ["title", nil], ["updated_at", Tue, 28 Oct 2014 02:17:45 UTC +00:00]]
---
  def add_tmdb
    if(params["tmdb_movies"] == nil || params["tmdb_movies"].empty?)
      flash[:notice] = "No movies selected"
      redirect_to movies_path
    else
      ids_array = params["tmdb_movies"].keys
      Movie::create_from_tmdb(ids_array)